#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "Розклад занять групи КНІТ-14"<<endl;
    int N;
    cout << "Введіть номер дня тижня :";
	cin >> N; 
	cout<<endl;
	switch (N)
	{
	case  1 :
	{
		cout << "1. Українська мова (за професiйним спрямуванням)\n2. Комп'ютерна дискретна матиматика\n3. Програмування (пiдр. 2) " << endl << endl;
	}
	break;
	case  2:
	{
		cout << "1. Основи теоретичної iнформатики (пiдгр. 1) \n2. Програмування\n3. Лiнiйна а лгебра i аналiтична геометрiя (пiдр. 2)\n4. Основи теоретичної iнформатики (пiдгр. 1) " << endl << endl;
	}
	break;
	case  3:
	{
		cout << "1. Комп'ютерна дискретна матиматика \n2. Iноземна мова (за професiйним спрямуванням)\n3. Фiзичне виховання\n4. Лiнiйна а лгебра i аналiтична геометрiя " << endl << endl;
	}
	break;
	case  4:
	{
		cout << "1. Алгоритми та структуриданних (пiдгр. 1)\n   Основи теоретичної iнформатики (пiдгр. 2)\n2. Алгоритми та структуриданних\n3. Алгоритми та структуриданних (пiдгр. 2)" << endl << endl;
	}
	break;
	case  5:
	{
		cout << "1. Програмування (пiдгр. 1)\n   Основи теоретичної iнформатики (пiдгр. 2)\n2. Основи теоретичної iнформатики (пiдгр. 1)\n3. Основи теоретичної iнформатики " << endl << endl;
	}
	break;
	case  6 : case 7:
	{
		cout << "В цей день тижня занять немає"<<endl<<endl;
	}
	break;
		
	default:
		cout<< "Введіть адекватне число" << endl << endl;
		break;
	}
}
